<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="3" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="position_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="position_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="beam_idx" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="beam_idx">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_88614" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="5" name="ShapeOf_88600" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_88602" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_88604" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Gather_88605" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_88607" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_88609" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_88611" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Concat_88612" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Broadcast_88615" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ReadValue_88188" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.9.valuepresent.9.value" variable_type="f32" variable_shape="?,8,?,128" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.9.value">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_87558" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Gather_87559" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_77288" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="28" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.model.embed_tokens.weight" type="Const" version="opset1">
			<data element_type="bf16" shape="151936, 1024" offset="4124" size="311164928" />
			<output>
				<port id="0" precision="BF16" names="self.model.embed_tokens.weight">
					<dim>151936</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.model.embed_tokens/ov_ext::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="BF16">
					<dim>151936</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>151936</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.model.embed_tokens/ov_ext::embedding/Convert_1" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.model.embed_tokens/ov_ext::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="22" name="__module.model.embed_tokens/ov_ext::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>151936</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="281,363,374,hidden_states.1,inputs_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_77148" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 128" offset="311169052" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_77144" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="311169564" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_77143" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="311173660" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_77141" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="311173664" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.layers.0.input_layernorm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="364">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_399" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="311173668" size="8" />
			<output>
				<port id="0" precision="I64" names="365">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.model.layers.0.input_layernorm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="366,variance.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_77142" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="311173676" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.model.layers.0.input_layernorm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="367">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="368">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="369,370,hidden_states.3,hidden_states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="371,373,hidden_states.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="self.model.layers.0.self_attn.q_proj.weight" type="Const" version="opset1">
			<data element_type="bf16" shape="2048, 1024" offset="311173680" size="4194304" />
			<output>
				<port id="0" precision="BF16" names="self.model.layers.0.self_attn.q_proj.weight">
					<dim>2048</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.layers.0.self_attn.q_proj/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="BF16">
					<dim>2048</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.layers.0.self_attn.q_proj/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="384">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_85876" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="315367984" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="386,388,hidden_states.11,hidden_states.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_77147" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="311173660" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_77145" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="311173664" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.model.layers.0.self_attn.q_norm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="389">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_468" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="311173668" size="8" />
			<output>
				<port id="0" precision="I64" names="390">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.layers.0.self_attn.q_norm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="391,variance.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_77146" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="311173676" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.layers.0.self_attn.q_norm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="392">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.model.layers.0.self_attn.q_norm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.model.layers.0.self_attn.q_norm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="393">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.layers.0.self_attn.q_norm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="394,395,hidden_states.13,hidden_states.15">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.layers.0.self_attn.q_norm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="396">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.model.layers.0.self_attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="315368016" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.model.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="397,q.1">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.model.rotary_emb/aten::to/Convert" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1" offset="315368032" size="256" />
			<output>
				<port id="0" precision="FP32" names="334">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="ShapeOf_79159" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_79160" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_79161" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="58" name="Gather_79162" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="1003,1164,1180,1341,1357,1518,1534,1695,1711,1872,1888,2049,2065,2226,2242,2403,2419,2580,2596,2757,2773,2934,2950,3111,3127,3288,3304,335,3465,3481,3642,3658,3819,3835,3996,4012,4173,4189,4350,4366,4527,4543,456,4704,472,4720,4881,4897,5058,5074,5235,5251,633,649,810,826,987">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_68480" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368288" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_68482" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368288" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.model.rotary_emb/prim::ListConstruct" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.rotary_emb/aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="337,338,343,inv_freq_expanded,inv_freq_expanded.1">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="219" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="315368288" size="8" />
			<output>
				<port id="0" precision="I64" names="219" />
			</output>
		</layer>
		<layer id="64" name="__module.model.rotary_emb/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="340,341">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.rotary_emb/aten::to/Convert_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="342,344,position_ids_expanded,position_ids_expanded.1">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.model.rotary_emb/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="345">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model.rotary_emb/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="315368296" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model.rotary_emb/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="346,freqs">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.model.rotary_emb/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="348,emb">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.rotary_emb/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="349,350,353,356,cos.1,cos.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1126,1303,1480,1657,1834,2011,2188,2365,2542,2719,2896,3073,3250,3427,3604,3781,3958,4135,418,4312,4489,4666,4843,5020,5197,595,772,949,cos,cos.11,cos.13,cos.15,cos.17,cos.19,cos.21,cos.23,cos.25,cos.27,cos.29,cos.31,cos.33,cos.35,cos.37,cos.39,cos.41,cos.43,cos.45,cos.47,cos.49,cos.5,cos.51,cos.53,cos.55,cos.57,cos.7,cos.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.model.layers.0.self_attn/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="420">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_783" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368308" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_785" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368316" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_787" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368288" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_739" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368324" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.layers.0.self_attn/aten::slice/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="430,x2.1">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.model.layers.0.self_attn/aten::neg/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="315368332" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="79" name="__module.model.layers.0.self_attn/aten::neg/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="80" name="__module.model.layers.0.self_attn/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="431">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_680" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_724" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368308" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_726" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368288" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_678" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368324" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.model.layers.0.self_attn/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="425,x1.1">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="__module.model.layers.0.self_attn/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="433">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.model.rotary_emb/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="351,352,354,357,sin.1,sin.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1127,1304,1481,1658,1835,2012,2189,2366,2543,2720,2897,3074,3251,3428,3605,3782,3959,4136,419,4313,4490,4667,4844,5021,5198,596,773,950,sin,sin.11,sin.13,sin.15,sin.17,sin.19,sin.21,sin.23,sin.25,sin.27,sin.29,sin.31,sin.33,sin.35,sin.37,sin.39,sin.41,sin.43,sin.45,sin.47,sin.49,sin.5,sin.51,sin.53,sin.55,sin.57,sin.7,sin.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.model.layers.0.self_attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="434">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.model.layers.0.self_attn/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="435,query.1">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_88626" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="92" name="Constant_88619" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_88621" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_88623" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Concat_88624" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Broadcast_88627" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="ReadValue_88078" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.0.keypresent.0.key" variable_type="f32" variable_shape="?,8,?,128" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.0.key">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_87501" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="99" name="Gather_87502" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_77152" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 128" offset="315368336" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.model.layers.0.self_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="bf16" shape="1024, 1024" offset="315368848" size="2097152" />
			<output>
				<port id="0" precision="BF16" names="self.model.layers.0.self_attn.k_proj.weight">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.model.layers.0.self_attn.k_proj/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="BF16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.model.layers.0.self_attn.k_proj/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="399">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_85877" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="317466000" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.model.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="401,403,hidden_states.17,hidden_states.19">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_77151" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="311173660" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_77149" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="311173664" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.model.layers.0.self_attn.k_norm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="404">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_555" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="311173668" size="8" />
			<output>
				<port id="0" precision="I64" names="405">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.model.layers.0.self_attn.k_norm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="406,variance.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_77150" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="311173676" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.layers.0.self_attn.k_norm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="407">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.model.layers.0.self_attn.k_norm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.model.layers.0.self_attn.k_norm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="408">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.model.layers.0.self_attn.k_norm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="409,410,hidden_states.21,hidden_states.23">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.model.layers.0.self_attn.k_norm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="411">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.model.layers.0.self_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="315368016" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.model.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="412,k.1">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="__module.model.layers.0.self_attn/aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="436">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_926" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368308" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_928" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368316" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_930" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368288" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_882" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="315368324" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.model.layers.0.self_attn/aten::slice/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="446,x2.3">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.model.layers.0.self_attn/aten::neg/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="315368332" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="126" name="__module.model.layers.0.self_attn/aten::neg/ConvertLike_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
